Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Setting a :term:`LICENSE` in a recipe applies to the software to be built by this recipe, not to the recipe file itself. The license of recipes, configuration files and scripts should also be clearly specified, for example via comments or via a license found in the :term:`layer` that holds these files. These license files are usually found at the root of the layer. Exceptions should be clearly stated in the layer README or LICENSE file.
it_it: Impostare una :term:`LICENSE` in una ricetta si applica al software da compilare tramite quella ricetta, non al file della ricetta stessa. La licenza delle ricette, dei file di configurazione e degli script deve essere specificata chiaramente, ad esempio tramite commenti o tramite una licenza presente nel :term:`layer` che contiene questi file. Questi file di licenza si trovano solitamente nella directory principale del layer. Le eccezioni devono essere chiaramente indicate nel file README o nel file LICENSE del layer.

source: Setting a Different Port
it_it: Impostazione di Una Porta Diversa

source: Setting the :term:`MACHINE` variable through this fragment must follow this syntax::
it_it: L'impostazione della variabile :term:`MACHINE` tramite questo frammento deve seguire questa sintassi::

source: Setting up External Access
it_it: Configurazione dell'Accesso Esterno

source: Setting up Git to Send Email
it_it: Configurazione di Git per l'Invio di Email

source: Setting up a Hash Equivalence server is described in the :doc:`/dev-manual/hashequivserver` section of the Yocto Project Development Tasks Manual.
it_it: La configurazione di un server di equivalenza hash è descritta nella sezione :doc:`/dev-manual/hashequivserver` del Manuale di Sviluppo dei Task di Yocto Project.

source: Setting up the build environment creates a :term:`Build Directory` if one does not already exist. BitBake uses the :term:`Build Directory` for all its work during builds. The Build Directory has a ``conf`` subdirectory that contains default versions of your :ref:`structure-build-conf-local.conf` and :ref:`structure-build-conf-bblayers.conf` :term:`configuration files <Configuration File>`. These default :term:`configuration files <Configuration File>` are created only if they do not already exist in the :term:`Build Directory` at the time you source the build environment setup script.
it_it: La configurazione dell'ambiente di compilazione crea una :term:`Build Directory` se non esiste già. BitBake utilizza questa :term:`Build Directory` per tutte le sue operazioni durante la compilazione. La Build Directory contiene una sottodirectory``conf`` che include le versioni di default dei file di configurazione :ref:`structure-build-conf-local.conf` e :ref:`structure-build-conf-bblayers.conf` :term:`configuration files <Configuration File>`. Questi :term:`file di configurazione <Configuration File>` di default vengono creati solo se non sono già presenti nella :term:`Build Directory` al momento dell'esecuzione dello script di configurazione dell'ambiente di compilazione.

source: Setup a build environment with the following command:
it_it: Configurare un ambiente di build con il seguente comando:

source: Several different versions of ``matchbox-desktop`` might exist. BitBake chooses the one selected by the distribution configuration. You can get more details about how BitBake chooses between different target versions and providers in the ":ref:`bitbake-user-manual/bitbake-user-manual-execution:preferences`" section of the BitBake User Manual.
it_it: Potrebbero esistere diverse versioni di ``matchbox-desktop``. BitBake sceglie quella selezionata dalla configurazione della distribuzione. Maggiori dettagli su come BitBake sceglie tra le diverse versioni e provider di destinazione nella sezione ":ref:`bitbake-user-manual/bitbake-user-manual-execution:preferences`" del Manuale Utente di BitBake.

source: Several tools described in this How-to do just that, including ``trace-cmd`` and KernelShark in the next section.
it_it: Diversi strumenti descritti in questa guida svolgono proprio questa funzione, tra cui ``trace-cmd`` e KernelShark, che verranno presentati nella sezione successiva.

source: Shared State Cache
it_it: Cache di Shared State

source: Shared State Location
it_it: Posizione dello Shared State

source: Shared State Signing
it_it: Firma dello Stato Condiviso

source: Shared library updates, for example to fix a security vulnerability. For sure, the programs using such a library should be rebuilt, but their new binaries should remain identical. The corresponding tasks should have a different output hash because of the change in the hash of their library dependency, but thanks to their output being identical, Hash Equivalence will stop the propagation down the dependency chain.
it_it: Aggiornamenti di librerie shared [condivise], ad esempio per correggere una vulnerabilità di sicurezza. Certamente, i programmi che utilizzano tale libreria dovrebbero essere ricompilati, ma i loro nuovi binari dovrebbero rimanere identici. Le attività corrispondenti dovrebbero avere un hash di output diverso a causa della modifica dell'hash della loro dipendenza dalla libreria, ma grazie al fatto che il loro output è identico, l'equivalenza dell'hash bloccherà la propagazione lungo la catena di dipendenza.

source: Sharing your build results over the web server while blocking others from starting builds on your host.
it_it: Condividere i risultati delle build sul server web, impedendo al contempo ad altri di avviare build sul proprio host.

source: Shell Function formatting
it_it: Formattazione delle Funzioni Shell

source: Signature of shared state and its verification can happen on two different hosts, meaning one host can be in charge of the signature while another only verifies the artifacts. This is preferred as the private key should not be shared between multiple hosts.
it_it: La firma dello shared state e la sua verifica possono avvenire su due host diversi, il che significa che un host può occuparsi della firma mentre un altro si limita a verificare gli artefatti. Questa soluzione è preferibile in quanto la chiave privata non dovrebbe essere condivisa tra più host.

source: Signing the shared state artifacts that the :term:`OpenEmbedded Build System` generates with your **private key**.
it_it: Firmare gli artefatti di shared state che :term:`OpenEmbedded Build System` genera con la propria **chiave privata**.

source: Similarly, stable branches maintained by the project may have corresponding ``-next`` branches which collect proposed changes. For example, ``blacksail-next`` and ``wrynose-next`` branches in both the "openembedded-core" and "meta-yocto" repositories.
it_it: Analogamente, i branch stabili gestiti dal progetto possono avere corrispondenti branch ``-next`` che raccolgono le modifiche proposte. Ad esempio, i branch ``blacksail-next`` e ``wrynose-next`` nei repository "openembedded-core" e "meta-yocto".

source: Similarly, the above is a snapshot of the Sysprof display of a ``copy-from-user`` call chain.
it_it: Analogamente, l'immagine sopra riportata è un'istantanea della visualizzazione di Sysprof di una catena di chiamate ``copy-from-user``.

source: Similarly, when the recipe version :term:`PV` is not compatible with software versions used by the upstream software component releases and the CVE database, these can be fixed using the :term:`CVE_VERSION` variable.
it_it: Analogamente, quando la versione della ricetta :term:`PV` non è compatibile con le versioni del software utilizzate dalle release dei componenti software a monte e con il database CVE, è possibile risolvere il problema utilizzando la variabile :term:`CVE_VERSION`.

source: Simultaneously, all executables and shared libraries installed by the recipe are inspected to see what shared libraries they link against. For each shared library dependency that is found, :term:`PKGDATA_DIR` is queried to see if some package (likely from a different recipe) contains the shared library. If such a package is found, a runtime dependency is added from the package that depends on the shared library to the package that contains the library.
it_it: Contemporaneamente, tutti gli eseguibili e le librerie shared installati dalla ricetta vengono esaminati per verificare a quali librerie shared si collegano. Per ogni dipendenza da libreria shared trovata, viene interrogata :term:`PKGDATA_DIR` per verificare se qualche pacchetto (probabilmente di una ricetta diversa) contiene la libreria shared. Se viene trovato un pacchetto di questo tipo, viene aggiunta una dipendenza di runtime dal pacchetto che dipende dalla libreria shared al pacchetto che contiene la libreria.

source: Simultaneously, all pkg-config modules installed by the recipe are inspected to see what other pkg-config modules they depend on. A module is seen as depending on another module if it contains a "Requires:" line that specifies the other module. For each module dependency, :term:`PKGDATA_DIR` is queried to see if some package contains the module. If such a package is found, a runtime dependency is added from the package that depends on the module to the package that contains the module.
it_it: Contemporaneamente, tutti i moduli pkg-config installati dalla ricetta vengono esaminati per verificare da quali altri moduli pkg-config dipendono. Un modulo viene considerato dipendente da un altro modulo se contiene una riga "Requires:" che specifica l'altro modulo. Per ogni dipendenza tra moduli, viene interrogata la directory :term:`PKGDATA_DIR` per verificare se qualche pacchetto contiene il modulo. Se viene trovato un pacchetto di questo tipo, viene aggiunta una dipendenza di runtime dal pacchetto che dipende dal modulo al pacchetto che lo contiene.

source: Since :term:`STAMPS_DIR` is usually a subdirectory of :term:`TMPDIR`, removing :term:`TMPDIR` will also remove :term:`STAMPS_DIR`, which means tasks will properly be rerun to repopulate :term:`TMPDIR`.
it_it: Poiché :term:`STAMPS_DIR` è solitamente una sottocartella di :term:`TMPDIR`, la rimozione di :term:`TMPDIR` comporterà anche la rimozione di :term:`STAMPS_DIR`, il che significa che i task verranno rieseguiti correttamente per ripopolare :term:`TMPDIR`.

source: Since the Linux kernel became a CVE Numbering Authority (CNA), the number of associated CVEs has increased dramatically. Security teams must address these CVEs to meet regulatory and customer requirements. Automation on identifying issues helps to reduce their workload.
it_it: Dal momento che il kernel Linux è diventato un CVE Numbering Authority (CNA), i numero di CVE associato è aumentato drammaticamente. I team di sicurezza devono affrontare questi CVE per soddisfare i requisiti normativi e dei clienti. L'automazione sull'identificazione dei problemi aiuta a ridurre il carico di lavoro.

source: Since the service is running in a detached screen session, you can attach to it using this command::
it_it: Poiché il servizio è in esecuzione in una sessione screen distaccata, ci si può connettere ad esso utilizzando questo comando::

source: Slow Write Speed on Live Images
it_it: Velocità di Scrittura Ridotta sulle Immagini Live

source: So far, all you have done is quickly built an image suitable for emulation only. This section shows you how to customize your build for specific hardware by adding a hardware layer into the Yocto Project development environment.
it_it: Finora, tutto ciò che si è fatto è stato creare rapidamente un'immagine adatta solo all'emulazione. Questa sezione mostra come personalizzare la build per un hardware specifico aggiungendo un layer hardware all'ambiente di sviluppo di Yocto Project.

source: So far, there are solutions for shell scripts. What about Python tasks? The same approach applies even though these tasks are more difficult. The process needs to figure out what variables a Python function accesses and what functions it calls. Again, the incremental build solution contains code that first figures out the variable and function dependencies, and then creates a checksum for the data used as the input to the task.
it_it: Finora, abbiamo trovato soluzioni per gli script di shell. E per i task Python? Si applica lo stesso approccio, anche se questi task sono più complessi. Il processo deve individuare a quali variabili accede una funzione Python e quali funzioni chiama. Anche in questo caso, la soluzione di build incrementale include del codice che prima individua le dipendenze tra variabili e funzioni e poi crea un checksum per i dati utilizzati come input per il task.

source: So you've finished the :doc:`/brief-yoctoprojectqs/index` and glanced over the document :doc:`/what-i-wish-id-known`, the latter containing important information learned from other users. You're well prepared. But now, as you are starting your own project, it isn't exactly straightforward what to do, and the documentation is daunting. We've put together a few hints to get you started.
it_it: È stata completato la documentazione :doc:`/brief-yoctoprojectqs/index` ed è stato visto il documento :doc:`/what-i-wish-id-known`, quest'ultimo contenente informazioni importanti apprese da altri utenti. Si è ben preparati. Ma ora che si sta iniziando il proprio progetto, non è così semplice capire cosa fare e la documentazione può sembrare scoraggiante. Abbiamo raccolto alcuni suggerimenti per aiutare ad iniziare.

source: So, if the type as specified by the :term:`IMAGE_FSTYPES` were ``ext4``, the dynamically generated task would be as follows::
it_it: Quindi, se il tipo specificato da :term:`IMAGE_FSTYPES` fosse ``ext4``, il task generata dinamicamente sarebbe il seguente::

source: So, in order to be able to access all of the tools described here, you can build and boot an ``sdk`` image, perhaps one of::
it_it: Pertanto, per poter accedere a tutti gli strumenti descritti qui, è possibile creare e avviare un'immagine ``sdk``, ad esempio una delle seguenti::

source: Software Layer
it_it: Layer Software

source: Some BSPs require or depend on additional layers beyond the BSP's root layer in order to be functional. In this case, you need to specify these layers in the ``README`` "Dependencies" section of the BSP's root layer. Additionally, if any build instructions exist for the BSP, you must add them to the "Dependencies" section.
it_it: Alcuni BSP richiedono o dipendono da layer aggiuntivi oltre al layer radice del BSP per essere funzionanti. In questo caso, è necessario specificare questi layer nella sezione "Dependencies" del layer radice del BSP nel file ``README``. Inoltre, se esistono istruzioni di compilazione per il BSP, è necessario aggiungerle alla sezione "Dependencies".

source: Some Basic Terms
it_it: Alcuni Termini di Base

source: Some elements that can influence the build are not verified. It is assumed that the operating system running the system is secure and of a known setup and version. The system goes to significant lengths to isolate against host contamination of the output but it is certainly possible, especially maliciously.
it_it: Alcuni elementi che possono influenzare la compilazione non vengono verificati. Si presume che il sistema operativo in esecuzione sia sicuro e di versione nota. Il sistema adotta misure significative per isolare l'output da eventuali contaminazioni provenienti dall'host, ma ciò è certamente possibile, soprattutto in modo malevolo.

source: Some key tags for the ``yocto-docs`` repository are ``kirkstone-4.0.30``, ``scarthgap-5.0.1``, and ``blacksail-6.1``. These tags represent Yocto Project releases.
it_it: Alcuni tag chiave per il repository ``yocto-docs`` sono ``kirkstone-4.0.30``, ``scarthgap-5.0.1`` e ``blacksail-6.1``. Questi tag rappresentano le release di Yocto Project.

source: Some layers function as a layer to hold other BSP layers. These layers are known as ":term:`container layers <Container Layer>`". An example of this type of layer is OpenEmbedded's :oe_git:`meta-openembedded </meta-openembedded>` layer. The ``meta-openembedded`` layer contains many ``meta-*`` layers. In cases like this, you need to include the names of the actual layers you want to work with, such as::
it_it: Alcuni layer fungono da layer per contenere altri layer del BSP. Questi layer sono noti come ":term:`container layers <Container Layer>`". Un esempio di questo tipo di layer è il layer :oe_git:`meta-openembedded </meta-openembedded>` di OpenEmbedded. Il layer ``meta-openembedded`` contiene molti layer ``meta-*``. In casi come questo, è necessario includere i nomi dei layer effettivi con cui si desidera lavorare, ad esempio::

source: Some tasks are easier to implement when allowed to perform certain operations that are normally reserved for the root user (e.g. :ref:`ref-tasks-install`, :ref:`do_package_write* <ref-tasks-package_write_deb>`, :ref:`ref-tasks-rootfs`, and :ref:`do_image_* <ref-tasks-image>`). For example, the :ref:`ref-tasks-install` task benefits from being able to set the UID and GID of installed files to arbitrary values.
it_it: Alcuni task sono più facili da implementare quando è consentito loro di eseguire determinate operazioni normalmente riservate all'utente root (ad esempio :ref:`ref-tasks-install`, :ref:`do_package_write* <ref-tasks-package_write_deb>`, :ref:`ref-tasks-rootfs` e :ref:`do_image_* <ref-tasks-image>`). Ad esempio il task :ref:`ref-tasks-install` trae vantaggio dalla possibilità di impostare l'UID e il GID dei file installati su valori arbitrari.

source: Some upstream projects maintain stable branches that only collect bug fixes and security patches --- similar to the Yocto Project's own stable release policy. For recipes tracking such upstreams, it is possible to perform *stable point release upgrades* (e.g. upgrading from 1.0.2 to 1.0.3) rather than only accepting backported patches. This is the mechanism behind the "acceptable: version updates which follow an upstream stable series" policy above.
it_it: Alcuni progetti upstream mantengono branch stabili che includono solo correzioni di bug e patch di sicurezza, in modo simile alla politica di rilascio stabile di Yocto Project. Per le ricette che seguono tali progetti upstream, è possibile eseguire *stable point release upgrades* [aggiornamenti a release stabili] (ad esempio, l'aggiornamento dalla versione 1.0.2 alla 1.0.3) anziché accettare solo patch retroportate. Questo è il meccanismo alla base della politica "accettabili: aggiornamenti di versione che seguono una serie stabile upstream" descritta sopra.

source: Sometimes it is useful to determine the status of a build in progress. To get the status of pending builds, use the following call::
it_it: A volte è utile determinare lo stato di una build in corso. Per ottenere lo stato delle build in sospeso, si utilizza la seguente chiamata::

source: Sometimes it is useful to determine the status of a specific build. To get the status of a specific build, use the following call::
it_it: A volte è utile determinare lo stato di una build specifica. Per ottenere lo stato di una build specifica, utilizzare la seguente chiamata::

source: Source Control Managers (Optional)
it_it: Gestori di Controllo Versione (opzionale)

source: Source Directory Structure
it_it: Struttura della Directory Sorgente

source: Source Fetching
it_it: Prelievo del Codice Sorgente

source: Source Mirror(s)
it_it: Mirror del Codice Sorgente

source: Source the tools environment setup script by using a command like the following::
it_it: Eseguire lo script di configurazione dell'ambiente degli strumenti utilizzando un comando simile al seguente::

source: Sources
it_it: Sorgenti

source: Spaces must be used for indenting Python code, with 4 spaces per tab
it_it: Gli spazi devono essere utilizzati per l'indentazione del codice Python, con 4 spazi per tabulazione.

source: Spaces should be used for indenting variables, with 4 spaces per tab
it_it: Gli spazi devono essere utilizzati per l'indentazione delle variabili, con 4 spazi per tabulazione.

source: Specifically, this chapter addresses open source philosophy, source repositories, workflows, Git, and licensing.
it_it: Nello specifico, questo capitolo tratta la filosofia open source, i repository del codice sorgente, i flussi di lavoro, Git e le licenze.

source: Specifies whether to produce an output package even if it is empty. By default, BitBake does not produce empty packages. This default behavior can cause issues when there is an :term:`RDEPENDS` or some other hard runtime requirement on the existence of the package.
it_it: Specifica se produrre un pacchetto di output anche se vuoto. Per default, BitBake non produce pacchetti vuoti. Questo comportamento predefinito può causare problemi quando è presente un :term:`RDEPENDS` o altri requisiti di runtime stringenti sull'esistenza del pacchetto.

source: Stable Point Release Upgrades
it_it: Aggiornamenti a Release Stabili

source: Stable Release Process
it_it: Iter per il Rilascio Stabile

source: Stable/LTS Patch Acceptance Policies
it_it: Politiche di Accettazione delle Patch per le Release Stabili/LTS

source: Stamp Files and the Rerunning of Tasks
it_it: File Stamp e Riesecuzione dei Task

source: Start the trace::
it_it: Avviare la traccia::

source: Start your builds.
it_it: Avviare le build.

source: Starting Toaster for Local Development
it_it: Avvio di Toaster per lo Sviluppo Locale

source: Status of each CVE: ``Patched``, ``Unpatched`` or ``Ignored``
it_it: Stato di ogni CVE: ``Patched``, ``Unpatched`` o ``Ignored``

source: Streamlining git send-email usage
it_it: Ottimizzazione dell'utilizzo di "git send-email"

source: Submitted to upstream, waiting for approval. Optionally include where it was submitted, such as the author, mailing list, etc.
it_it: Inviata al progetto upstream, in attesa di approvazione. Facoltativamente, includi dove è stata inviata, ad esempio l'autore, la mailing list, ecc.

source: Submitting Changes to Stable Release Branches
it_it: Invio di Modifiche ai Branch di Rilascio Stabili

source: Subscribing to the Mailing List
it_it: Iscrizione alla Mailing List

source: Such a simple-minded test doesn't always yield much of interest, but sometimes it does (see the :yocto_bugs:`Slow write speed on live images with denzil ` bug report).
it_it: Un test così semplice non sempre fornisce risultati interessanti, ma a volte sì (bug report :yocto_bugs:`Slow write speed on live images with denzil `).

source: Such notifications happen over confidential, non-public means. Typically, the project initiating this "embargo" directly notifies a selected number of people from each project, including a subset of the security team. When Yocto Project is a part of such a notified group, developers prepare fixes on separate infrastructure and test it. They might also include additional developers and domain experts who can help with the fix and eventual regressions. When the embargo is lifted, they send a patch to the relevant public list, and the usual review process starts.
it_it: Tali notifiche avvengono tramite canali riservati e non pubblici. In genere, il progetto che avvia l'"embargo" notifica direttamente un numero selezionato di persone di ciascun progetto, incluso un sottoinsieme del team di sicurezza. Quando Yocto Project fa parte di questo gruppo notificato, gli sviluppatori preparano le correzioni su un'infrastruttura separata e le testano. Potrebbero anche includere altri sviluppatori ed esperti del settore che possono contribuire alla risoluzione del problema e a eventuali regressioni. Una volta terminato l'embargo, inviano una patch alla mailing list pubblica competente e inizia il normale processo di revisione.
